In [1]:
data = {'Brand':['Samsung','Nokia','Mi','Apple','Samsung'],
       'Model':['M1','C1','Note6','iphone6','S1'],
       'Unit':[5,4,8,9,3]}

In [2]:
print(data)

{'Brand': ['Samsung', 'Nokia', 'Mi', 'Apple', 'Samsung'], 'Model': ['M1', 'C1', 'Note6', 'iphone6', 'S1'], 'Unit': [5, 4, 8, 9, 3]}

In [3]:
print(type(data))

<class 'dict'>

In [4]:
import pandas as pd

In [10]:
df1 = pd.DataFrame(data,['a','b','c','d','e'])

In [11]:
df1

     Brand    Model  Unit
a  Samsung       M1     5
b    Nokia       C1     4
c       Mi    Note6     8
d    Apple  iphone6     9
e  Samsung       S1     3

In [32]:
df1.iloc[[1,3],[0,2]]

   Brand  Unit
b  Nokia     4
d  Apple     9

In [42]:
df1.groupby('Brand').sum()

         Unit
Brand
Apple       9
Mi          8
Nokia       4
Samsung     8

In [43]:
df1.groupby('Brand').count()

         Model  Unit
Brand
Apple        1     1
Mi           1     1
Nokia        1     1
Samsung      2     2

In [44]:
df1.groupby('Brand').describe()

         Unit
        count mean       std  min  25%  50%  75%  max
Brand
Apple     1.0  9.0       NaN  9.0  9.0  9.0  9.0  9.0
Mi        1.0  8.0       NaN  8.0  8.0  8.0  8.0  8.0
Nokia     1.0  4.0       NaN  4.0  4.0  4.0  4.0  4.0
Samsung   2.0  4.0  1.414214  3.0  3.5  4.0  4.5  5.0

In [45]:
df1.groupby('Brand').describe().transpose()

Brand       Apple   Mi  Nokia   Samsung
Unit count    1.0  1.0    1.0  2.000000
     mean     9.0  8.0    4.0  4.000000
     std      NaN  NaN    NaN  1.414214
     min      9.0  8.0    4.0  3.000000
     25%      9.0  8.0    4.0  3.500000
     50%      9.0  8.0    4.0  4.000000
     75%      9.0  8.0    4.0  4.500000
     max      9.0  8.0    4.0  5.000000